[
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=287653\ncontent: Tourism in Albania has been a key element to the country's economic activity and is constantly developing. Albania is characterized by its rich archaeological",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=287653"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=3844880\ncontent: Andorra is a tourist destination in Europe. Andorra has several major ski resorts, including Soldeu/El Tarter and Pal/Arinsal. These are very popular",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=3844880"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=24488725\ncontent: Tourism in Armenia has been a key sector to the Armenian economy since the 1990s when tourist numbers exceeded half a million people visiting the country",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=24488725"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=159124\ncontent: Tourism forms an important part of the economy of Austria, accounting for almost 9% of the Austrian gross domestic product. Austria has one guest bed",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=159124"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=23575502\ncontent: Tourism in Azerbaijan has been an important sector of the Azerbaijani economy since the 1990s. According to Azerbaijan's Center for Economic and Social",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=23575502"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=18950915\ncontent: economy of Belarus is an upper-middle income mixed economy. As a post-Soviet transition economy, Belarus rejected most privatisation efforts in favour of",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=18950915"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=159602\ncontent: Tourism in Belgium is one of Belgium's industries. Its accessibility from elsewhere in Europe makes it a popular tourist destination. The tourist industry",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=159602"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=5013280\ncontent: Tourism in Bosnia and Herzegovina is a fast-growing sector making up an important part in the economy of the country. Beside a number of spots and attractions",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=5013280"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=73947\ncontent: Forests Tourism in Bulgaria is a significant contributor to the country's economy. Situated at the crossroads of the East and West, Bulgaria has been",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=73947"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=1092749\ncontent: Tourism in Croatia (Croatian: turizam u Hrvatskoj) is a major industry of country's economy, accounting for almost 20% of Croatia's gross domestic product",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=1092749"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=9582172\ncontent: Tourism in Cyprus occupies a dominant position in the country's economy, and has significantly impacted its culture and multicultural development throughout",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=9582172"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=159095\ncontent: of tourism in the Czech Republic. Prague is one of the most visited cities of the world, with 6–8 million visitors per year. For the needs of tourism, the",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=159095"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=159609\ncontent: Tourism in Denmark is a growing industry and a major economic contributor: tourists spent a total of DKK 128 billion and the tourism industry employed",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=159609"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=68787151\ncontent: Tourism in Estonia refers to the overall state of the tourism industry in the Finno-Ugric nation of Estonia. It is a key part of the country's economy",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=68787151"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=159637\ncontent: added by tourism was about 4.6 billion euros, or 2.6% of the Finnish GDP, providing approximately 140,200 jobs. Most visitors arriving to Finland come from:",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=159637"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=159621\ncontent: Tourism in France directly contributed 79.8 billion euros to gross domestic product (GDP) in 2013, 30% of which comes from international visitors and 70%",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=159621"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=30497376\ncontent: Tourism in Georgia may refer to: Tourism in Georgia (country) Tourism in Georgia (U.S. state) This disambiguation page lists articles associated with the",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=30497376"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=580850\ncontent: destinations worldwide. In 2012, over 30.4 million international tourists arrived in Germany, bringing over US$38 billion in international tourism receipts to the",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=580850"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=159622\ncontent: Tourism in Greece has been a key element of the economic activity in the country, and is one of the country's most important sectors. Greece has been a",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=159622"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=17548619\ncontent: long history of tourism in Hungary, and Hungary was the world's thirteenth most visited tourist destination country in 2002. Tourism increased by nearly",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=17548619"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=17545821\ncontent: Tourism in Iceland has grown considerably in economic significance in the past 15 years. As of 2016, the tourism industry is estimated to contribute about",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=17545821"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=6756873\ncontent: Tourism in the Republic of Ireland is one of the biggest contributors to the economy of Ireland, with 9.0 million people visiting the country in 2017,",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=6756873"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=159620\ncontent: Tourism in Italy is one of the largest economic sectors of the country. With 60 million tourists per year (2023), Italy is the fourth most visited country",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=159620"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=48522717\ncontent: Kazakhstan is the ninth-largest country by area and the largest landlocked country in the world. Tourism is not a major component of the economy. As of",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=48522717"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=31551483\ncontent: Tourism in Kosovo is characterized by archaeological heritage from Illyrian, Dardanian, Roman, Byzantine, Serbian and Ottoman times, traditional Albanian",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=31551483"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=68850202\ncontent: Tourism in Latvia is an emerging industry in the nation of Latvia. 2.8 million visitors were recorded in 2018, an increase of 8% compared to 2017. In",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=68850202"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=17810\ncontent: Liechtenstein (/ˈlɪktənstaɪn/ LIK-tən-styne; German: [ˈlɪçtn̩ʃtaɪn] ), officially the Principality of Liechtenstein (German: Fürstentum Liechtenstein",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=17810"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=6681283\ncontent: points of Lithuania. Domestic tourism is also highly popular: in 2018 it grew by 12%. Lithuanians also prefer to spend their vacations in Lithuania – 70 percent",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=6681283"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=30892694\ncontent: Tourism is an important component of the national economy of Luxembourg, representing about 8.3% of GDP in 2009 and employing some 25,000 people or 11",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=30892694"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=30631353\ncontent: Tourism in Malta is an important sector of the country's economy, contributing to about 15 percent of the nation's gross domestic product (GDP). It is",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=30631353"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=26331579\ncontent: Tourism in the Republic of Moldova focuses on the country's natural landscapes and its history. Wine tours are offered to tourists across the country.",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=26331579"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=19261\ncontent: Monaco, officially the Principality of Monaco, is a sovereign city-state and microstate on the French Riviera a few kilometres west of the Italian region",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=19261"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=5464956\ncontent: Ada Bojana and Buljarica. Montenegro can be presented as a destination offering a variety of attractions and all-year tourism is possible by publicizing",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=5464956"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=159636\ncontent: Top tourist attractions in the Netherlands Tourism in the Netherlands is a relatively small sector of the country's economy with a total contribution",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=159636"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=17550294\ncontent: Tourism in North Macedonia is a large factor of the nation's economy. The country's large abundance of natural and cultural attractions make it suitable",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=17550294"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=159610\ncontent: As of 2019, Norway ranks 22nd in the World Economic Forum's Travel and Tourism Competitiveness Report. Tourism in Norway contributed 4.2% of the gross",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=159610"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=159091\ncontent: Poland is a part of the global tourism market with constantly increasing number of visitors. Tourism in Poland contributes to the country's overall economy",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=159091"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=6756772\ncontent: Tourism in Portugal serves millions of international and domestic tourists. Tourists visit to see cities, historic landmarks, enjoy beaches, or religious",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=6756772"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=1098278\ncontent: Romania's tourism sector had a direct contribution of EUR 5.21 billion to the Gross Domestic Product (GDP) in 2018, slightly higher than in 2017, placing",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=1098278"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=159643\ncontent: Tourism in Russia plummeted in 2022. Only 200,100 foreigners visited Russia in 2022, a drop of 96.1% from pre-pandemic/pre-Russian invasion of Ukraine",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=159643"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=9023718\ncontent: Tourism in San Marino, known also as the Most Serene Republic of San Marino (Italian: Serenissima Repubblica di San Marino) is an integral element of the",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=9023718"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=44716712\ncontent: Tourism in Serbia is officially recognized as a primary area for economic and social growth. The hotel and catering sector accounted for approximately",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=44716712"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=5716861\ncontent: Tourism in Slovakia offers natural landscapes, mountains, caves, medieval castles and towns, folk architecture, spas and ski resorts. More than 5.0 million",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=5716861"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=343109\ncontent: Retrieved 11 November 2023. https://www.slovenia.info/ Media related to Tourism in Slovenia at Wikimedia Commons Wikivoyage has a travel guide for Slovenia.",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=343109"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=159557\ncontent: Tourism in Spain is a major contributor to national economic life, contributing to about 12.4% of Spain's GDP (in 2019). Ever since the 1960s and 1970s",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=159557"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=156793\ncontent: Tourism in Sweden comprised a relatively small part of the Swedish economy in 2011 at 2.9% of the country's GDP; at this time, tourism generated 264 billion",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=156793"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=9023823\ncontent: [update] tourism accounted for an estimated 2.6% (CHF 16.8 billion) of Switzerland's gross domestic product, compared to 2.6% (CHF 12.8 billion) in 2001.",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=9023823"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=2059413\ncontent: Tourism in Turkey is focused largely on a variety of historical sites, and on seaside resorts along its Aegean and Mediterranean Sea coasts. Turkey has",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=2059413"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=159644\ncontent: Russo-Ukrainian War, Ukraine occupied 8th place in Europe by the number of tourists visiting, according to the World Tourism Organization rankings. Ukraine",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=159644"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=1683858\ncontent: Tourism in the United Kingdom is a major industry and contributor to the U.K. economy, which is the world's 10th biggest tourist destination, with over",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=1683858"
        }
    },
    {
        "page_content": "URL: https://en.wikipedia.org/?curid=7532678\ncontent: Wikivoyage has a travel guide for Vatican City. The main Tourism in Vatican City are focused in religious tourism and city tourism, including the visit to the",
        "metadata": {
            "url": "https://en.wikipedia.org/?curid=7532678"
        }
    }
]